# -*- coding: utf-8 -*- 
def logo():
    print "\33[31m-------------------------------------------------------------------"
    print "\r\n"
    print "        \33[31mcccccccc                "
    print "       \33[33mu        \33[33mu               \33[37m#名字:Cupper"
    print "      \33[33mu          \33[33mu              \33[37m#作者:Saferman"
    print "     \33[33mu   \33[7m):S:(\33[0m    \33[33mu             \33[37m#简介:           "
    print "      \33[32mp          \33[32mp                   \33[37m......没什么好说的......"
    print "         \33[32mp    \33[32mp                 \33[37m#联系方式:*******:)"
    print "           \33[34mer"
    print "\r\n"
    print "-------------------------------------------------------------------"
    print "\r\n"
